app/controllers/levels_controller.rb

SELECT "levels".* FROM "levels"
---
  def index
    @levels = Level.all

SELECT  "levels".* FROM "levels" WHERE "levels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_level
      @level = Level.find(params[:id])