app/controllers/schools_controller.rb

INSERT INTO "schools" ("name", "description", "phone", "direction", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @school = School.new(school_params)

    respond_to do |format|
      if @school.save

SELECT "schools".* FROM "schools"
SELECT "levels".* FROM "levels"
SELECT "subjects".* FROM "subjects"
---
  def dash_utp
    @schools = School.all
    @levels = Level.all
    @subjects = Subject.all